from pytorch_pretrained_bert import BertTokenizer, BertModel
import torch
import numpy as np
import flashtext


# Load pre-trained model tokenizer (vocabulary)
tokenizer = BertTokenizer.from_pretrained('/shared/experiments/xyu71/lorelei2019/data/bert_model/il10')
print('Tokenizer loaded.')

model = BertModel.from_pretrained('/shared/experiments/xyu71/lorelei2019/data/bert_model/il10', from_tf=False)
print('Model loaded.')
model.eval()
# print(model.eval())


mention = ' චීන '
mask = ' [MASK] '
text_file = "හම්බන්තොට වරාය විකිණීම දේශද්රෝහී ක්රියාවක්   Sunday, December 18, 2016  හම්බන්තොට වරාය විකිණීම දේශද්‍රෝහී ක්‍රියාවක්  ඩොලර් මිලියන් 15000 ක් වියදම් ණයට ගෙන වියදම් කර ඉදිකෙරුණු හම්බන්තොට වරාය චීන රජයට අයත සමාගමකට අවුරුදු 99 කට බලපාන පරිදි විකිණීමට රජය ගෙන ඇති තීරණය රටේ පැත්තෙන් බලනවිට ඉතා නරක එකකි. රටේ සම්පත් විකුණාගෙන කෑමට එජාප ආණ්ඩු රුසියෝය. පසුගිය ආණ්ඩුව කලේ ණය ලබාගෙන හෝ රටට සම්පත් එකතුකිරීමය. දවසකට කන්ටේනර් තුන්හාරසීයක් බෑමට හැකියාව ඇති බහාළුම් පර්යන්තයකින් කන්ටේනර් දහයක් පහලොවක් බෑවත් එම කන්ටේනර් පර්යන්තය රටේ සම්පතකි. වඩාත්ම ප්‍රයෝජනයට ගන්නා නැව්මාර්ගයක් ආසන්නයේ පිහිටා ඇති හම්බන්තොට වරායට නැව් ගෙන්නා ගැනීමට රජය අපොහොසත් වී ඇත්තේ ඔවුන්ගේ අකාර්‍යක්ෂමතාව නිසාය. හම්බන්තොට වරායක් ඇතිබව නොදන්නා නැව් සමාගම් සහ කැප්ටන් වරුන්ට පෙනෙන ලෙස අඩුම ගණනේ හම්බන්තොට මුහුදේ බෝඩ් ලෑල්ලක් වත් ගැසීමට ආණ්ඩුව කිසිම පියවරක් ගෙන නැත.  අද පවතින තත්ත්වය අනුව හම්බන්තොට වරායේ ආදායම එහි ආයෝජනය පියවීම පසෙක තිබියදී එමණයට අදාල පොලිය ගෙවීමට වත් ප්‍රමාණවත් නැති වුණත් එය චීනයට විකිණීම නොකල යුතුය. එම පොලිය සහ මුදල විදේශ මුදල් වලින් ගෙවීමට ඇති නිසා තවත් ලක්ෂයක් දෙකක් කාන්තාවන් මැදපෙරදිග යවා ණය ගෙවීම වඩා සුදුසුබව බව යහපාලනය රජයට නොතේරේ.  අද ලෝකයේ විශාලතම නිෂ්පාදකයා වී ඇත්තේ චීනයයි. එම නිෂ්පාදන සඳහා අවශ්‍ය අමුද්‍රව්‍ය ප්‍රවාහනය කිරීමත් නිමි භාණ්ඩ ඉල්ලුම්කරුවන්ට ප්‍රවාහනය කිරීමත් නිසා වානිජ නැව් වල ධාරිතාව වැඩියෙන්ම පාවිච්චි කරන රට චීනය යැයි සිතීම සාධාරණය. එමෙන්ම චීනයේ බලශක්ති අවශ්‍යතාවලට ආනයනය කරන තෙල් ප්‍රමාණයෙන් 85% වත් තමන්ට අයිති තෙල් නැව් වලින් පමණක් ප්‍රවාහනය කරන මට්ටමට යාමට චීනයේ බලාපොරොත්තුව බව කියැවේ. ලෝක ආර්ථිකයේ විශාලතම ආනයන සහ අපනයන කරු බවට පත්වී ඇති චීනයට චීනය සහ චීනය විශාල වශයෙන් අමුද්‍රව්‍ය ලබා ගන්නා අප්‍රිකා මහද්වීපය සහ චීනයේ නිශ්පාදන ආනයනය කරන උතුරු දකුණු ඇමෙරිකා රටවල් සහ යුරෝපය අතර මැද ඇති ලංකාවේ වරායක් චීනය විසින් ක්‍රියාත්මක කරන වරායක් කිරීම නිසා රටට වන හානිය සුළුපටු නොවේ.  2014 න් අවසන් වූ දසවසර තුල චීනයට අයත් නෞකා ප්‍රමාණය (දල ධාරිතාව මත ) තුන්ගුණයකින් වැඩි වී ඇතැයි පහත වගුව පෙන්නා දෙයි.  2014 දත්ත අනුව අළුත් වානිජ නැව් සඳහා සියළුම රටවල් වලින් තබා ඇති ඇණවුම් ප්‍රමාණයෙන් විශාලම ඇණවුම් ප්‍රමාණය තබා ඇත්තේ චීනයයි. එය 27% පමණ ප්‍රමාණයකි. එමෙන්ම එය ඊලඟට විශාලම ඇණවුම් ප්‍රමාණය තබා ඇති ග්‍රීසිය මෙන් හතර ගුණයකි. යුරෝප ආර්ථිකයේ විශාලතම ආර්ථිකය වන ජර්මනිය තබා ඇත්තේ චීනෙයේ ඇණවුම් ප්‍රමාණයෙන් දහයෙන් එකකි. අනාගතයේදීත් විශාල නැව් ප්‍රමාණයක් ලෝක මුහුදු මාර්ග වල යෙදවීමට චීනය බලාපොරොත්තුවන බව මෙම දත්ත වලින් පෙනේ. එවන් රටකට ලෝකයේ කාර්‍යය බහුලම නැව්මාර්ගයක් ආසන්නයේ ඇති වරායක් බදුදීමෙන් රට වන හානිය අතිවිශාල බව රජයට තේරුම් නොයාම පුදුමයකි.  චීන පාලනය යටතේ හම්බන්තොට වරාය ආසියානු ප්‍රදේශයේ කාර්‍යබහුලම වරායක් වීමට ඉඩ ඇත. එවිට එම නැව් සහ වරාය සේවකයන්ට ආහාර, ඉඳුම් හිටුම්, නිවාඩු නිකේතන ආදිය හම්බන්තොට අවට ප්‍රදේශවලින් සැපයීමට සිදුවීමෙන් එම ප්‍රදේශවල ආර්ථිකයට වන හානිය රජය තේරුම් ගොස් නැත. චීන පාලනය යටතේ මෙම වරාය ආසියාවේ කාර්‍ය බහුලම වරායක් වුවහොත් විශාල විදේශිකයින් පිරිසක් එහි සේවය කරනු ඇත. එය මත්තල ගුවන් තොටුපලටද විශාල ගුවන් යානා ප්‍රමාණයක් පැමිණීමට හේතුවක් වනු ඇත. එමඟින් ගුවන් තොටුපොලටද අඩුම තරමේ වියදම උපයා ගැනීමට හැකි තත්ත්වයක් ලැබීමද රජයේ මෙම ක්‍රියාවෙන් වන හානියකි.  කාර්‍යබහුල වරායකින් ඒඅවට විශාල ප්‍රමාණයක් රැකියා ඇතිවීමට සහ ආශ්‍රිත කර්මාන්ත වලින් තවත් රැකියා ඇතිවීමද එම ප්‍රදේශය ශීඝ්‍රයෙන් දියුණුවීමද සිදුවීමට ඉඩ ඇත. මෙමඟින් වන්නේ මැදපෙරදිගට ගැහැණුන් යවා පිට ගැහැණුන් සමඟ සම්බන්ධකම් පැවැත්වීමට එම ප්‍රදේශ වල පිරිමින්ට ඇති අවස්ථාව නැතිකර දැමීමේ කුමන්ත්‍රණයක්ද ඇති බව පැහැදිලිය.  ලෝක ප්‍රසිද්ධ ෆෝබ්ස් සඟරාව ලෝකයේ හිස්ම ගුවන් තොටුපොල විරුදාවලිය ලඟකදී මත්තල ගුවන් තොටුපොලට ලබා දෙන ලදී. රජය හම්බන්තොට වරාය විකුණා දැමීමෙන් කරන්න උත්සාහ කරන්නේ එවන් ඉහල අගැයීම් ලබාගත් රටේ සම්පත් අන්සතුකර එම විරුදාවලිය රටට අහිමි කිරීමේ කුමන්ත්‍රණයක් බව මහජනතාව තේරුම් ගත යුතුය. රජය මෙම දේශද්‍රෝහී ක්‍රියාවට යොමුවීමට තවත් හේතුවක් ඇත. චීනය මෙම වරාය අවුරුදු 99 බද්දකට ලබාගත්විට එයට හම්බන්තොට චැන් චින් චුන් වරාය වැනි නමක් දීමට බොහෝදුරට ඉඩ ඇත. එවිට මහින්ද රාජපක්ෂ වරාය යන නම ලෝක වරාය නාමාවලියෙන් ඉවත්වනු ඇත. 21ක් වන සියවසේ ශ්‍රී ලංකාවේ රජ වූ එකම රජුගේ නම මෙම වරායට තිබීම ගැන යහපාලන ආණ්ඩුව තුල ඇත්තේ ඉරිසියාවක් බවත් මෙම විකිණීම කරන්නේ එමඟින් මෙම නම වරායෙන් ඉවත් කිරීමට බවත් දේශප්‍රේමී මහජනතාව තේරුම් ගැනීම වැදගත්ය.  එල ද බ්‍රා මෙන්ඩා December 18, 2016 at 8:51 AM බලපන් මොන තරම් වැරදි වැඩක්ද මේ ආණ්ඩුව කරලා තියෙන්නේ ..උබ කලබල නොවී හිටහන් පහුගිය දවස් ටිකේ \"සියල්ලට ඉහලින් සියල්ල දකිනා සියලුතැන් හි සරනා සියල්ලන්ටම සැලකර සිටිනා \" එත් \"නාවික හමුදාපති අදුරන්නේ නැති\" මාද්‍යවේදියෝ කිව්වා ආණ්ඩුව එයාලගේ කරපිටින් අවසන් ගමන් යවනවා කියලා...ඒකට බයවෙලා දැන් උබ කිව්ව වැඩ ටික ඔක්කොම නැවතිලා ඇති.. සමහර විට මේ වෙනකොටත් නාවික හමුදාපති අගමැති ජනාදිපති ඉල්ලා අස්වෙලද දන්නේ නැහැ  ඉයන් December 18, 2016 at 12:29 PM ඔව් ඔව් ඒව එහෙම තමයි වෙන්න ඕන මෙන්ඩො.  එල ද බ්‍රා මෙන්ඩා December 18, 2016 at 8:55 AM මම එක උන සතුටටයි චීන කෑල්ලක් සෙට් කරගන්න තිබුන අවස්ථාව නැති උන දුකටයි අඩියක් ගහන්නම ඕනේ ..  ඉයන් December 18, 2016 at 12:24 PM ඒකාලේ කිව්වෙ චීනෙට කොලඹ පෝට් සිටි එකෙන් සින්නක්කරේට අක්කර 500 ක් දෙන එක වැරදියි කියලා. මේකෙන් කරන්නේ වරාය අවුරුදු 99 කට බදු දීමක්. අපිට දුවාගන්න හැකියාවක් නැති ව්‍යාපෘතියක් ඔවුන්ට දුවන්න දීල ඒකෙන් එන වාසි එනම් රැකියා, ආශ්‍රිත රැකියා, ආහර නිෂ්පාදන අංශයේ රැකියා අනිකුත් කර්මාන්ත ඇතිවීමට ඉඩ සැලැස්වීම.  රසිකොලොජිස්ට් - Rasikologist December 18, 2016 at 9:50 AM ඉයන්ලාටවත් චීන විස්කි බීමට අවස්ථාව ලැබේවා.  ඉයන් December 18, 2016 at 12:36 PM අපිට කොහෙද මාළු, අපි යනවද මූදු  surangamlr December 18, 2016 at 9:50 AM ඉයන් මහතා නැවතත් වලගෙ පාගගෙන නොවැ. එක පාරටම නැව් එන්නෙ නෑ. ගෙන්නන්න ඕනෑ. ඒකට උපදෙස් ගන්න හොඳම අය තමයි දුරගමන් බස්වලට තේ බොන තැං පවත්තගෙන යන කඩ මුදලාලිලා. ඒ ක්‍රමේට ගත්තොත් මුලිම්ම ලංකාවට කිට්ටු වරායකිං අදාල නැවට නැගලා නැවේ ඩැයිබරටයි ක්ලීනර් කොලුවටයි  \"අපි මේ පොඩි වරායක් හැදුවා. ඩිංගක් ගොඩවෙලා යන්න එන්න ඕනැ එහෙනං. ඕං මුලිම්ම කිව්වෙ මල්ලිල දෙන්නට තමා\"  කියල බුලත් අතක් දීල ආරාධනා කරන්න ඕනැ. ආං එතකොට නැවේ අයත්  \"යං එහෙනං ගිහිං එන්න නැත්තං හරිනෑනෙ. බුලත් දීල ආරාධනා කෙරුවං\"  කියල එනව යමිං එමිං ගමං. ආං එදාට දෙන්ට ඕනැ බඩ පිරෙන්න කන්න බොන්න. ආයි ගහේ බඩු. ගෙනියන්න ඕනැ නං දඩමස්, මීපැණි ආදියෙන් මුල් දෙහෙකුයි, වේලපු තණමල්විල එව්වෑං ටිකකුයි. ඒ අතරෙ කොල්ලෝ දෙන්නෙක් දම්මලා සැම්පු පැකැට් දෙහෙකුයි වතුර පනිට්ටු හත අටකුයි දීලා නැවත් පොඩ්ඩක් හෝදල දෙන්න ඕනි.  මුලිම්ම තෙල් ගහද්දි හොරට ගහන්න නරකයි. කන බොන ටික උනත් පිලිවෙලට දෙන්න ඕනි. ඔය විදිහට ටික කලක් යනකොට නිකම්ම නැව් ගොඩ ගැහෙනවා. ආං එදාට පොම්පෙං හොරට තෙල් ගහලා, බතල වෑංජනේ මැදට දාපු එලෝලු රොටි ගිනි ගානට විකුණලා ලාබ ලබන්න පුලුවං. හා නැද්ද?"
# t = ''
# for tt in text_file.split('.'):
#     if mention in tt:
#         t += tt
#         t += '. '
# text_file = t
# print(text_file)
text_wiki = 'පොදු වශයෙන් චීනය ලෙසින් හැඳින්වෙන චීන මහජන සමූහාණ්ඩුව යනු, බිලියන1.3 ට වැඩි ජනතාවක් වෙසෙන, ලොව වඩාත්ම ජනාකීර්ණ රාජ්‍යය වෙයි. නැගෙනහිර ආසියාවෙහි පිහිටි චීනය, චීන කොමියුනිස්ට් පක්ෂය විසින් පාලනය කරනු ලබන තනි-පක්ෂ රාජ්‍යයකි. චීන කොමියුනිස්ට් පක්ෂය විසින් පළාත් 22 ක් මතද , ස්වතන්ත්‍ර ප්‍රදේශයන් පහක් මතද, සෘජු ලෙසින් පරිපාලිත මහ නගර සභා ප්‍රදේශයන් සතරක් (බෙයිජිං, ටියාංජිං, ෂැංහයි, සහ චොංකිං) මතද, අතිශයින් ස්වතන්ත්‍ර විශේෂ පරිපාලන ප්‍රදේශයන් දෙකක් – හොං කොං සහ මැකාවු – මතද සිය අධිපත්‍යය පතුරවයි. එහි අගනගරය බෙයිජිං වෙයි'
text_wiki_en = "China, officially the People's Republic of China (PRC), is a country in East Asiaand the world's most populous country, with a population of around 1.404 billion.Covering approximately 9,600,000 square kilometers (3,700,000 sq mi), it is the third- or fourth-largest country by total area. Governed by the Communist Party of China, the state exercises jurisdiction over 22 provinces, five autonomous regions, four direct-controlled municipalities (Beijing, Tianjin, Shanghai, and Chongqing), and the special administrative regions of Hong Kong and Macau."
text_wiki_unrelevent = "ගාලු කොටුව යනු ශ්‍රී ලංකාවේ ගාල්ල ප්‍රදේශයේ පිහිටි පෘතුගීසීන් විසින් ඉදිකරන ලද බලකොටුවකි. පසුව එය 17 වන සියවසේදී ලන්දේසීන් විසින් නවීකරණය කරන ලද අතර මේ වන විට එය අවුරුදු 400 ක අතීතයකට හිමිකම් කියයි. වර්තමානයේ කොටුවට පිවිසීම සඳහා දොරටු දෙකක් භාවිතා කෙරේ. රජයේ කාර්යාල ගොඩනැගිලි රැසක්ම කොටු පවුර ආශ්‍රිතව වර්තමානය දක්වා ම පවත්වගෙන යන ලදි. නමුදු මේ වන විට ඒවා ටිකින් ටික ඉවත් කරමින් පවතී. ලොක උරුමයක් ලෙස නම් කරන ලද ගාලු කොටුව සුන්දර මෙන්ම ඉපැරණි වස්තුවකි. ගාලු කොටුව පිහිටා තිබෙන්නේ ශ්‍රී ලංකාවේ ගිනිකොණ මුහුදු තීරයේ ය .එය 1588 දී පෘතුගීසින් විසින් නිමවූවකි.පසුව ලන්දේසීන් විසින් එය 17 වන ශත වර්ෂයේදී පුළුල් ලෙස නවීකරණය කරන ලදී.එය පෘතුගීසින් විසින් ලොවට දායාද කල ආශ්චර්යමත් නිමැවුමකි.ගාලු කොටුව පෞරාණික වටිනාකමකින් උක්ත බව එක්සත් ජාතීන්ගේ සංවිධානය විසින් පිළිගෙන ඇත.එහි ලන්දේසි ගෘහ නිර්මන ශිල්පය පිලිබඳ කදිම නිද්සුනකි. ලන්දේසි කොටුව හෝ ගාල්ලේ පවුර ලෙස හදුන්වයි.ලන්දේසි කොටුව ප්‍රතිසංස්කරණය කරන ලද්දකි.ගාලු කොටුව ශ්‍රී ලංකාවේ ප්‍රධාන සංචාරක ආකර්ශනයකට හිමිකම් කියන ප්‍රදේශයකි. එය ශ්‍රී ලංකාවට ඇති වාස්තුවිද්‍යාත්මක සහ පුරාවිද්‍යාත්මක දායාදයකි."


# mention = ' මුල්ලේගම '
# text_file = " මහනුවර කලහයෙන් 2ක් මරුට 11කට තුවාල - 71ක් සැකපිට   (තරිඳු ජයවර්ධන සහ ඉන්දිකා රාමනායක)  මාර්තු 04 වැනි දා සිට අද (08 වැනිදා) උදෑසන දක්වා මහනුවර දිස්ත්රික්කයේ ඇතිවූ කළහකාරී සිද්ධීන්වලින් දෙදෙනෙක් මියගිය බවත් 11 දෙනෙක් තුවාල ලැබූ බව පොලිස් මාධ්ය ප්රකාශක පොලිස් අධිකාරී රුවන් ගුණසේකර මහතා පැවසීය. මෙම සිදුවීම් සම්බන්ධයෙන් අද වන විට 71 දෙනකු සැකපිට අත්අඩංගුවට ගෙන තිබිණ.  මහනුවර දිස්ත්රික්කයේ තෙල්දෙණිය, මැණික්හින්න, දිගන සහ අකුරණ ඇතුළු ප්රදේශ කිහිපයක ඇතිවූ සිදුවීම් සම්බන්ධ වාර්තාව පොලිසිය විසින් අද ප්රකාශයට පත් කරන ලදි. රජයේ ප්රවෘත්ති අධ්යක්ෂ ජනරාල් නීතීඥ සුදර්ශන ගුණවර්ධන, පොලිස් මාධ්ය ප්රකාශක පොලිස් අධිකාරී රුවන් ගුණසේකර සහ යුද හමුදා මාධ්ය ප්රකාශක බ්රිගේඩියර් සුමිත් අතපත්තු යන මහත්වරුන්ගේ ප්රධානත්වයෙන් අද පොලිස් මූලස්ථානයේ පැවැති මාධ්ය හමුවකදී මෙම තොරතුරු ප්රකාශයට පත් කළේය.  මාර්තු 05 වැනිදා රාත්රී පල්ලේකැලේ පොලිස් වසමේ වෙළෙඳසලක් හා නිවසක් ගිනි තබා ඇතැයි ද එම නිවස තුල තිබී 26 හැවිරිදි තරුණයකුගේ මළ සිරුරක් සොයා ගත්තේයැයි ද, දුම ආඝ්රාණය වීමෙන් ඔහු මිය ගිය බව පශ්චාත් මරණ පරීක්ෂණයේදී අනාවරණය වීයැයි ද පොලිස් මාධ්ය ප්රකාශකවරයා සඳහන් කළේය.  පූජාපිටිය පොලිස් වසමේ මුල්ලේගම ප්රචණ්ඩකාරී ක්රියාවක් කිරීමට යෑමේදී අත්අබෝම්බයක් පිපිරී පුද්ගලයකු මිය ගොස් ඇතැයි ද, අත්බෝම්බයේ ආරක්ෂිත ඇණය මිය ගිය පුද්ගලයා සිටි ස්ථානයේ තිබී සොයා ගත්තේයැයිද ඔහු අවුරුදු 28ක පුද්ගලයකු බව ද පොලිස් මාධ්ය ප්රකාශකවරයා සඳහන් කළේය. එම අවස්ථාවේ තුවාල ලැබූ 11ක් රෝහල් ගත කරනු ලැබ සිටිති.  මාර්තු 04 වැනිදා රාත්රියේ සිට අද උදෑසන 6.00 දක්වා කාලයේ මහනුවර පොලිස් කොට්ඨාසයේ නිවාස හා වෙළෙඳසල්වලට අලාභ හානි කිරීමේ සිද්ධි 45ක් වාර්තා වූ බවත්, පූජනීය ස්ථානවලට අලාභ හානි කිරීමේ සිද්ධි 04 වාර්තා වූ බවත්, වාහනවලට අලාභහානි කිරීමේ සිද්ධි 11ක් වාර්තා වූ බවත් පොලිසිය කියයි.  මෙම සිදුවීම් සම්බන්ධයෙන් සැකපිට 71 එක් දෙනකු අත්අඩංගුවට ගෙන ඇති බව පොලිසිය කියයි. ඒ අතර ඇඳිරිනීතිය කඩ කළ හතර දෙනෙක් ද සිටිති.  එම සැකකරුවන් අත්අඩංගුවට ගත් පොලිසි මෙසේය.  මහනුවර පොලිසියෙන් 8යි  තෙල්දෙණිය පොලිසියෙන් 30යි  මැණික්හින්න පොලිසියෙන් 07යි  කටුගස්තොට පොලිසියෙන් 06යි  වත්තේගම පොලිසියෙන් 06යි  තලාතුඔය පොලිසියෙන් 13යි  පල්ලේකැලේ පොලිසියෙන් 01යි  නිවාස හා වෙළ ඳසල්වලට හානි කිරීමේ සිද්ධි පොලිස් වසම් අනුව මෙසේය.  රංගලින් 02යි  කඩුගන්නාවෙන් 05යි  මැණික්හින්නෙන් 01යි  පල්ලේකැලෙන් 16යි  තෙල්දෙණියෙන් 18යි  වත්තේගමින් 02යි  මහනුවරින් 1යි  පුජනීය ස්ථානවලට අලාභ හානි කිරීමේ සිදුවීම්.  කටුගස්තොටින් 03යි  පුජාපිටියෙන් 01යි  වාහනවලට අලාභ හානි කිරීමේ සිදුවීම්  රංගලින් 03යි  මැණික්හින්නෙන් 01යි  පල්ලේකැළෙන් 05යි  තෙල්දෙණියෙන් 02යි"
# text_wiki = 'මුල්ගිරිගල රජ මහා විහාරය ශ්‍රී ලංකාවේ වයඹ පළාතේ පුත්තලම දිස්ත්‍රික්කයේ නවගත්තේගම ප්‍රාදේශිය ලේකම් කොට්ඨාශය තුල මැරුම්ගොඩ ග්‍රාම නිලධාරි වසට අයත් මුල්ලේගම ග්‍රාමයේ පිහිටා තිබේ.'
# text_wiki_en = "Mulgirigala Raja Maha Vihara (Sinhalaː මුල්ගිරිගල රජ මහා විහාරය) is an ancient Buddhist temple in Puttalam District, Sri Lanka. The temple is situated at Mullegama village, about 2.5 km (1.6 mi) far from the Nawagattegama town. The temple has been formally recognised by the Government as an archaeological site in Sri Lanka.[1] It is believed that the temple was built by King Dappula during the Anuradhapura period.[1] The monastery complex consisted of a number of caves and inscriptions, constructed about 300 years ago."
# text_wiki_unrelevent = 'පොදු වශයෙන් චීනය ලෙසින් හැඳින්වෙන චීන මහජන සමූහාණ්ඩුව යනු, බිලියන1.3 ට වැඩි ජනතාවක් වෙසෙන, ලොව වඩාත්ම ජනාකීර්ණ රාජ්‍යය වෙයි. නැගෙනහිර ආසියාවෙහි පිහිටි චීනය, චීන කොමියුනිස්ට් පක්ෂය විසින් පාලනය කරනු ලබන තනි-පක්ෂ රාජ්‍යයකි. චීන කොමියුනිස්ට් පක්ෂය විසින් පළාත් 22 ක් මතද , ස්වතන්ත්‍ර ප්‍රදේශයන් පහක් මතද, සෘජු ලෙසින් පරිපාලිත මහ නගර සභා ප්‍රදේශයන් සතරක් (බෙයිජිං, ටියාංජිං, ෂැංහයි, සහ චොංකිං) මතද, අතිශයින් ස්වතන්ත්‍ර විශේෂ පරිපාලන ප්‍රදේශයන් දෙකක් – හොං කොං සහ මැකාවු – මතද සිය අධිපත්‍යය පතුරවයි. එහි අගනගරය බෙයිජිං වෙයි'

# mention = ' හම්බන්තොට '
# text_file = " හම්බන්තොට වරාය චීන – ශ්‍රී ලංකා ඒකාබද්ධ සමාගම් දෙකක් යටතට පවරයි    හම්බන්තොට වරාය චීන ශ්රී ලංකා ඒකාබද්ධ සමාගම් දෙකක් යටතට අද පවරා දෙනු ලැබිණි.   ඒ, පාර්ලිමේන්තු පරිශ්රයේ අද පෙරවරුවේ පැවති උත්සවයකදී ය.  ඒ අනුව හම්බන්තොට වරායේ මෙහෙයුම් සහ සේවා කටයුතු, එච්.අයි.පී.ජී හෙවත් හම්බන්තොට ජාත්යන්තර වරාය සමූහය සහ එච්.අයි.පී.එස් හෙවත් හම්බන්තොට ජාත්යන්තර වරාය සේවා පෞද්ගලික සමගම යන සමාගම් දෙක වෙත පැවරෙනු ඇති.  අයෝජන ව්යාපෘතිය ආරම්භ කරමින් චයිනා මර්චන්ට් පෝට් හෝල්ඩින්ග් සමාගම ශ්රී රජයට ලබා දිය යුතු මුදලෙන් සියයට 30ක් වන අමෙරිකානු ඩොලර් මිලියන 294 ක චෙක්පත අග්රාමාත්යවරයා වෙත භාර දෙනු ලැබිණි.  මෙම අවස්ථාවට මුදල් අමාත්ය මංගල සමරවීර, ජාත්යන්තර වෙළෙඳ අමාත්ය මලික් සමරවික්රම සහ වරාය සහ නාවික කටයුතු අමාත්ය මහින්ද සමරසිංහ යන මහත්වරු ඇතුළු පිරිසක් එක්ව සිටියහ.  චයිනා මර්චන්ට් පෝට් හෝල්ඩින්ග් සමාගම වෙනුවෙන් එහි උපසභාපතිවරයා මෙම අවස්ථාවට සහභාගි විය.  අග්රාමාත්යවරයා එහිදී කියා සිටියේ, චීනයෙන් ලද මුදල් ප්රමාණය මෙරට විදේශ සංචිත ගිණුමේ, විශේෂ ගිණුමක තැම්පත් කරන බව ය."
# text_wiki = ' හම්බන්තොට ශ්‍රී ලංකාවේ දකුණු පළාතේ පිහිටි නගරයකි. 2004 සුනාමි ව්‍යසනයෙන්ද බැට කෑ මෙම දිස්ත්‍රික්කය කලක් ඌන සංවර්ධිත කලාපයක් සේ පැවැතුණි. නමුත් දැවැන්ත සංවර්ධන ව්‍යාපෘති රාශියක් මෙම කලාපයේ ක්‍රිය නැංවීම නිසා වර්ථමාන ශ්‍රී ලංකාවේ වේගයෙන් දියුණුවන නගර අතුරින් ප්‍රධාන නගරයක් ලෙස හම්බන්තොට හඳුනාගත හැක. ශ්‍රී ලංකාවේ කොළඹ නගරයෙන් පසු, දියුණු කරමින් පවතින ප්‍රධානම අනාගත වාණිජ නගරය වන්නේද මේ හම්බන්තොට නගරයයි.'
# text_wiki_en = "Hambantota (Sinhala: හම්බන්තොට , Tamil: அம்பாந்தோட்டை) is the main town in Hambantota District, Southern Province, Sri Lanka. This underdeveloped area was hit hard by the 2004 Indian Ocean tsunami and is undergoing a number of major development projects including the construction of a new sea port and international airport finished in 2013. These projects and others such as Hambantota Cricket Stadium are said to form part of the government's plan to transform Hambantota into the second major urban hub of Sri Lanka, away from Colombo."

def get_embedding_from_text(text):
    # Tokenized input
    text = f"[CLS] {text} [SEP]"
    tokenized_text = tokenizer.tokenize(text)

    # Convert token to vocabulary indices
    indexed_tokens = tokenizer.convert_tokens_to_ids(tokenized_text)
    indexed_tokens = indexed_tokens[:500]
    # Define sentence A and B indices associated to 1st and 2nd sentences (see paper)
    # segments_ids = [0] * len(indexed_tokens)
    tokens_tensor = torch.tensor([indexed_tokens])
    # segments_tensors = torch.tensor([segments_ids])
    with torch.no_grad():
        encoded_layers, _ = model(tokens_tensor)
    embedding = encoded_layers[11][0].numpy()[0]
    return embedding / np.linalg.norm(embedding)


def get_masked_embedding_from_text(text, get_sentence=False):
    # Tokenized input

    text = text.replace(mention, mask)
    text = f"[CLS] {text} [SEP]"
    tokenized_text = tokenizer.tokenize(text)

    # Convert token to vocabulary indices
    indexed_tokens = tokenizer.convert_tokens_to_ids(tokenized_text)
    indexed_tokens = indexed_tokens[:500]
    mask_index = tokenizer.convert_tokens_to_ids(['[MASK]'])
    mask_indices = np.argwhere(np.array(indexed_tokens) == mask_index)
    print(mask_indices)
    # Define sentence A and B indices associated to 1st and 2nd sentences (see paper)
    # segments_ids = [0] * len(indexed_tokens)
    tokens_tensor = torch.tensor([indexed_tokens])
    # segments_tensors = torch.tensor([segments_ids])
    with torch.no_grad():
        encoded_layers, _ = model(tokens_tensor)
    embedding = encoded_layers[11][0].numpy()
    mask_embedding = embedding[mask_indices.reshape((mask_indices.size))]
    # emb = np.sum(mask_embedding, axis=0)
    emb = mask_embedding[0]
    emb = emb / np.linalg.norm(emb)
    return emb


# Convert inputs to PyTorch tensors


# Predict hidden states features for each layer
with torch.no_grad():
    file_embedding = get_masked_embedding_from_text(text_file)
    wiki_embedding = get_masked_embedding_from_text(text_wiki)
    wiki_en_embedding = get_embedding_from_text(text_wiki_en)
    wiki_embedding_unrelevent = get_embedding_from_text(text_wiki_unrelevent)

    simi1 = np.dot(file_embedding, wiki_embedding)
    print(f'file_embedding and wiki_embedding similarity {simi1}')
    simi2 = np.dot(file_embedding, wiki_en_embedding)
    print(f'file_embedding and wiki_en_embedding similarity {simi2}')
    simi3 = np.dot(wiki_embedding, wiki_en_embedding)
    print(f'wiki_embedding and wiki_en_embedding similarity {simi3}')

    print(f'file_embedding and wiki_embedding_unrelevent similarity {np.dot(file_embedding, wiki_embedding_unrelevent)}')
    print(f'wiki_embedding and wiki_embedding_unrelevent similarity {np.dot(wiki_embedding, wiki_embedding_unrelevent)}')
    print(f'wiki_embedding_unrelevent and wiki_en_embedding similarity {np.dot(wiki_embedding_unrelevent, wiki_en_embedding)}')